Revit 2015 API
AnalyticalModelStick.GetAlignmentMethod Method (AnalyticalElementSelector)
 Gets the alignment method for a given selector.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public AnalyticalAlignmentMethod GetAlignmentMethod(
	AnalyticalElementSelector selector
)
Visual Basic
Public Function GetAlignmentMethod ( _
	selector As AnalyticalElementSelector _
) As AnalyticalAlignmentMethod
Visual C++
public:
AnalyticalAlignmentMethod GetAlignmentMethod(
	AnalyticalElementSelector selector
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 End of the analytical model.
Return Value
 The alignment method at a given end.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelStick Class
GetAlignmentMethod Overload
Autodesk.Revit.DB.Structure Namespace